fluid/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    cylinder
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }    

    flapSide
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    flapTop
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    flapBottom
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    top
    {
        type            slip;
    }

    bottom
    {
        type            slip;
    }

    inlet
    {
     	type            fixedValue;
        value		uniform  (1 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}

// ************************************************************************* //
