fluid/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

10
(
    inlet
    {
        type            patch;
        nFaces          160;
        startFace       83272;
    }
    outlet
    {
        type            patch;
        nFaces          160;
        startFace       83432;
    }
    top
    {
        type            patch;
        nFaces          250;
        startFace       83592;
    }
    bottom
    {
        type            patch;
        nFaces          250;
        startFace       83842;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          41844;
        startFace       84092;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          41844;
        startFace       125936;
    }
    flapBottom
    {
        type            patch;
        nFaces          146;
        startFace       167780;
    }
    flapSide
    {
        type            patch;
        nFaces          2;
        startFace       167926;
    }
    flapTop
    {
        type            patch;
        nFaces          146;
        startFace       167928;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          68;
        startFace       168074;
    }
)

// ************************************************************************* //
