fluid/system/blockMeshDict
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
(0 -0.02 0)				//Vertex 0
(0 0.02758578 0)			//Vertex 1
(0 0.03241422 0)			//Vertex 2
(0 0.08 0)					//Vertex 3
(0.02758578 -0.02 0)			//Vertex 4
(0.02758578 0.02758578 0)		//Vertex 5		
(0.02758578 0.03241422 0)		//Vertex 6		
(0.02758578 0.08 0)			//Vertex 7			
(0.02893934 0.02893934 0)		//Vertex 8		
(0.02893934 0.03106066 0)		//Vertex 9
(0.03106066 0.02893934 0)		//Vertex 10
(0.03106066 0.03106066 0)		//Vertex 11
(0.03149979 0.029975 0)			//Vertex 12
(0.03149979 0.030025 0)			//Vertex 13
(0.03241422 -0.02 0)			//Vertex 14
(0.03241464 0.02758578 0)		//Vertex 15
(0.03300021 0.029975 0)			//Vertex 16
(0.03300021 0.030025 0)			//Vertex 17
(0.03241464 0.03241422 0)		//Vertex 18
(0.03241422 0.08 0)			//Vertex 19
(0.0665 -0.02 0)				//Vertex 20
(0.0665 0.02758578 0)			//Vertex 21
(0.0665 0.029975 0)			//Vertex 22
(0.0665 0.030025 0) 			//Vertex 23
(0.0665 0.03241422 0)			//Vertex 24
(0.0665 0.08 0)				//Vertex 25
(0.25 -0.02 0)				//Vertex 26
(0.25 0.02758578 0)			//Vertex 27
(0.25 0.029975 0)			//Vertex 28
(0.25 0.030025 0) 			//Vertex 29
(0.25 0.03241422 0)			//Vertex 30
(0.25 0.08 0)				//Vertex 31
(0 -0.02 0.001)					//Vertex 32
(0 0.02758578 0.001)			//Vertex 33
(0 0.03241422 0.001)			//Vertex 34
(0 0.08 0.001)					//Vertex 35
(0.02758578 -0.02 0.001)			//Vertex 36
(0.02758578 0.02758578 0.001)		//Vertex 37		
(0.02758578 0.03241422 0.001)		//Vertex 38	
(0.02758578 0.08 0.001)			//Vertex 39	
(0.02893934 0.02893934 0.001)		//Vertex 40
(0.02893934 0.03106066 0.001)		//Vertex 41
(0.03106066 0.02893934 0.001)		//Vertex 42
(0.03106066 0.03106066 0.001)		//Vertex 43
(0.03149979 0.029975 0.001)		//Vertex 44
(0.03149979 0.030025 0.001)		//Vertex 45
(0.03241422 -0.02 0.001)			//Vertex 46
(0.03241464 0.02758578 0.001)		//Vertex 47
(0.03300021 0.029975 0.001)		//Vertex 48
(0.03300021 0.030025 0.001)		//Vertex 49
(0.03241464 0.03241422 0.001)		//Vertex 50
(0.03241422 0.08 0.001)			//Vertex 51
(0.0665 -0.02 0.001)			//Vertex 52
(0.0665 0.02758578 0.001)		//Vertex 53
(0.0665 0.029975 0.001)			//Vertex 54
(0.0665 0.030025 0.001) 		//Vertex 55
(0.0665 0.03241422 0.001)		//Vertex 56
(0.0665 0.08 0.001)			//Vertex 57
(0.25 -0.02 0.001)				//Vertex 58
(0.25 0.02758578 0.001)			//Vertex 59
(0.25 0.029975 0.001)			//Vertex 60
(0.25 0.030025 0.001) 			//Vertex 61
(0.25 0.03241422 0.001)			//Vertex 62
(0.25 0.08 0.001)			//Vertex 63
);

// Grid refinement parameters

N1x 56;
N1y 56;

// N2x = N1x
N2y 10;

// N3x = N1x
N3y 56;

//N4y = N1y
N4x 10;

Nr 8;

//N8x = N4x
//N8y = N3y

N9y 6;

N10x 69;

//N11x = N10x
//N11y = N9y

Nxout 184;
NyWake 1;

Gr 2;
GrInv 0.5;

blocks
(
	hex (0 4 5 1 32 36 37 33) ($N1x $N1y 1) simpleGrading (1 1 1)
	hex (1 5 6 2 33 37 38 34) ($N1x $N2y 1) simpleGrading (1 1 1)
	hex (2 6 7 3 34 38 39 35) ($N1x $N3y 1) simpleGrading (1 1 1)
	hex (4 14 15 5 36 46 47 37) ($N4x $N1y 1) simpleGrading (1 1 1)
	hex (5 15 10 8 37 47 42 40) ($N4x $Nr 1) simpleGrading (1 $GrInv 1)
	hex (5 8 9 6 37 40 41 38) ($Nr $N2y 1) simpleGrading ($GrInv 1 1)
	hex (9 11 18 6 41 43 50 38) ($N4x $Nr 1) simpleGrading (1 $Gr 1)
	hex (6 18 19 7 38 50 51 39) ($N4x $N3y 1) simpleGrading (1 1 1)
	hex (10 15 16 12 42 47 48 44) ($Nr $N9y 1) simpleGrading ($Gr 1 1)
	hex (13 17 18 11 45 49 50 43) ($Nr $N9y 1) simpleGrading ($Gr 1 1)
	hex (14 20 21 15 46 52 53 47) ($N10x $N1y 1) simpleGrading (1 1 1)
	hex (15 21 22 16 47 53 54 48) ($N10x $N9y 1) simpleGrading (1 1 1)
	hex (17 23 24 18 49 55 56 50) ($N10x $N9y 1) simpleGrading (1 1 1)
	hex (18 24 25 19 50 56 57 51) ($N10x $N3y 1) simpleGrading (1 1 1)
	hex (20 26 27 21 52 58 59 53) ($Nxout $N1y 1) simpleGrading (3 1 1)
	hex (21 27 28 22 53 59 60 54) ($Nxout $N9y 1) simpleGrading (3 1 1)
	hex (22 28 29 23 54 60 61 55) ($Nxout $NyWake 1) simpleGrading (3 1 1)
	hex (23 29 30 24 55 61 62 56) ($Nxout $N9y 1) simpleGrading (3 1 1)
	hex (24 30 31 25 56 62 63 57) ($Nxout $N3y 1) simpleGrading (3 1 1)
);


edges
(
	arc 5 6 (0.02700015 0.03 0)
	arc 37 38 (0.02700015 0.03 0.001)
	arc 8 9 (0.0285 0.03 0)
	arc 40 41 (0.0285 0.03 0.001)

	arc 8 10 (0.03 0.0285 0)
	arc 40 42 (0.03 0.0285 0.001)
	arc 5 15 (0.03 0.02700015 0)
	arc 37 47 (0.03 0.02700015 0.001)
	
	arc 9 11 (0.03 0.0315 0)
	arc 41 43 (0.03 0.0315 0.001)
	arc 6 18 (0.03 0.03299985 0)
	arc 38 50 (0.03 0.03299985 0.001)
	
	arc 10 12 (0.03129904 0.02925 0)
	arc 42 44 (0.03129904 0.02925 0.001)
	arc 15 16 (0.03275418 0.02840987 0)
	arc 47 48 (0.03275418 0.02840987 0.001)
	
	arc 13 11 (0.03129904 0.03075 0)
	arc 45 43 (0.03129904 0.03075 0.001)
	arc 17 18 (0.03275418 0.03159013 0)
	arc 49 50 (0.03275418 0.03159013 0.001)
);

boundary
(
	inlet
	{
		type patch;
		faces
		(
			(33 1 0 32)
			(34 2 1 33)
			(35 3 2 34)
		);
	}

	outlet
	{
		type patch;
		faces
		(
			(31 63 62 30)
			(30 62 61 29)
			(29 61 60 28)
			(28 60 59 27)
			(27 59 58 26)
		);
	}
	
	top
	{
		type patch;
		faces
		(
			(3 35 39 7)
			(7 39 51 19)
			(19 51 57 25)
			(25 57 63 31)
		);
	}
	
	bottom
	{
		type patch;
		faces
		(
			(4 36 32 0)
			(14 46 36 4)
			(20 52 46 14)
			(26 58 52 20)
		);
	}
	
	flapTop
	{
		type wall;
		faces
		(
			(17 49 45 13)
			(23 55 49 17)
		);
	}
	
	flapBottom
	{
		type wall;
		faces
		(
			(54 22 16 48)
			(48 16 12 44)
		);
	}
	
	flapSide
	{
		type wall;
		faces
		(
			(55 23 22 54)
		);
	}
	
	cylinder
	{
		type wall;
		faces
		(
			(11 43 41 9)
			(43 11 13 45)
			(9 41 40 8)
			(42 10 8 40)
			(44 12 10 42)
		);
	}
	
	front
	{
		type empty;
		faces
		(
			(33 32 36 37)
			(34 33 37 38)
			(35 34 38 39)
			(37 36 46 47)
			(40 37 47 42)
			(38 37 40 41)
			(38 41 43 50)
			(39 38 50 51)
			(44 42 47 48)
			(43 45 49 50)
			(47 46 52 53)
			(48 47 53 54)
			(50 49 55 56)
			(51 50 56 57)
			(53 52 58 59)
			(54 53 59 60)
			(55 54 60 61)
			(56 55 61 62)
			(57 56 62 63)
		);
	}
	back
	{
		type empty;
		faces
		(
			(0 1 5 4)
			(1 2 6 5)
			(2 3 7 6)
			(4 5 15 14)
			(5 8 10 15)
			(5 6 9 8)
			(9 6 18 11)
			(6 7 19 18)
			(14 15 21 20)
			(10 12 16 15)
			(13 11 18 17)
			(15 16 22 21)
			(17 18 24 23)
			(18 19 25 24)
			(20 21 27 26)
			(21 22 28 27)
			(22 23 29 28)
			(23 24 30 29)
			(24 25 31 30)
		);
	}

);

mergePatchPairs
(
);
