fluid/system/controlDict
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    system;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs ( "librampAngularOscillatingDisplacementPointPatchVectorField.so" "libOpenFOAM.so" )


application         pimpleFoam;

startFrom           startTime;

startTime           0;

stopAt              endTime;

endTime             100;

deltaT              5e-4;

writeControl        adjustableRunTime;

writeInterval       0.001;

purgeWrite          0;

writeFormat         binary;

writePrecision      12;

writeCompression    off;

timeFormat          general;

timePrecision       8;

runTimeModifiable   true;


functions
{
    preCICE_Adapter
    {
        type preciceAdapterFunctionObject;
        libs ("libpreciceAdapterFunctionObject.so");
    }
}
