fluid/system/decomposeParDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

    numberOfSubdomains 4;
    
    method hierarchical;
    hierarchicalCoeffs
    {
        n (2 2 1);
        delta 0.001;
        order xyz;
    }
    
    constraints
    {
        singleProcessorFaceSets
        {
           //- Keep all of faceSet on a single processor. This puts all cells
           //  connected with a point, edge or face on the same processor.
           //  (just having face connected cells might not guarantee a balanced
           //  decomposition)
           // The processor can be -1 (the decompositionMethod chooses the
           // processor for a good load balance) or explicitly provided (upsets
           // balance)
           type    singleProcessorFaceSets;
           singleProcessorFaceSets (
           				(fsiFacesTop -1)
           				(fsiFacesBottom -1)
           				(fsiFacesSide -1)
           			    );
       }
    }
    
    distributed false;
    roots
    (
    );

